In [2]:
import pandas as pd
import pandasql as psql

## SELECT

### Exercice 1 : Recyclable and Low Fat Products

###### Write a solution to find the ids of products that are both low fat and recyclable. Return the result table in any order. The result format is in the following example. https://leetcode.com/problems/recyclable-and-low-fat-products/description/?envType=study-plan-v2&envId=top-sql-50

In [3]:
data = {
    'product_id': [0, 1, 2, 3, 4],
    'low_fats': ['Y', 'Y', 'N', 'Y', 'N'],
    'recyclable': ['N', 'Y', 'Y', 'Y', 'N']
}

Products = pd.DataFrame(data)
Products

   product_id low_fats recyclable
0           0        Y          N
1           1        Y          Y
2           2        N          Y
3           3        Y          Y
4           4        N          N

In [4]:
query = """
SELECT product_id FROM Products
WHERE low_fats = "Y" AND recyclable = "Y"
"""
psql.sqldf(query, locals())

   product_id
0           1
1           3

### Exercice 2 : Find Customer Referee

###### Find the names of the customer that are not referred by the customer with id = 2. Return the result table in any order. The result format is in the following example. https://leetcode.com/problems/find-customer-referee/description/?envType=study-plan-v2&envId=top-sql-50

In [5]:
data = {
    'id': [1, 2, 3, 4, 5, 6],
    'name': ['Will', 'Jane', 'Alex', 'Bill', 'Zack', 'Mark'],
    'referee_id': [None, None, 2, None, 1, 2]
}
Customer = pd.DataFrame(data)

In [6]:
query = """
SELECT name 
FROM Customer 
WHERE referee_id != 2 OR referee_id IS NOT null
"""
psql.sqldf(query, locals())

   name
0  Alex
1  Zack
2  Mark

### Exercice 3 : Big Countries

###### A country is big if:
###### - it has an area of at least three million (i.e., 3000000 km2), or it has a population of at least twenty-five million (i.e., 25000000).
###### Write a solution to find the name, population, and area of the big countries. Return the result table in any order. The result format is in the following example. https://leetcode.com/problems/big-countries/?envType=study-plan-v2&envId=top-sql-50

In [7]:
world_data = {
    'name': ['Afghanistan', 'Albania', 'Algeria', 'Andorra', 'Angola'],
    'continent': ['Asia', 'Europe', 'Africa', 'Europe', 'Africa'],
    'area': [652230, 28748, 2381741, 468, 1246700],
    'population': [25500100, 2831741, 37100000, 78115, 20609294],
    'gdp': [20343000000, 12960000000, 188681000000, 3712000000, 100990000000]
}

World = pd.DataFrame(world_data)
World

          name continent     area  population           gdp
0  Afghanistan      Asia   652230    25500100   20343000000
1      Albania    Europe    28748     2831741   12960000000
2      Algeria    Africa  2381741    37100000  188681000000
3      Andorra    Europe      468       78115    3712000000
4       Angola    Africa  1246700    20609294  100990000000

In [8]:
query = """
SELECT name, population, area FROM World
WHERE area >= 3000000 OR population >= 25000000
"""
psql.sqldf(query, locals())

          name  population     area
0  Afghanistan    25500100   652230
1      Algeria    37100000  2381741

### Exercice 4 : Article Views I

###### https://leetcode.com/problems/article-views-i/description/?envType=study-plan-v2&envId=top-sql-50

In [9]:
views_data = {
    'article_id': [1, 1, 2, 2, 4, 3, 3],
    'author_id': [3, 3, 7, 7, 7, 4, 4],
    'viewer_id': [5, 6, 7, 6, 1, 4, 4],
    'view_date': ['2019-08-01', '2019-08-02', '2019-08-01', '2019-08-02', '2019-07-22', '2019-07-21', '2019-07-21']
}

Views = pd.DataFrame(views_data)
Views

   article_id  author_id  viewer_id   view_date
0           1          3          5  2019-08-01
1           1          3          6  2019-08-02
2           2          7          7  2019-08-01
3           2          7          6  2019-08-02
4           4          7          1  2019-07-22
5           3          4          4  2019-07-21
6           3          4          4  2019-07-21

In [10]:
query = """
SELECT DISTINCT author_id AS id 
FROM Views
WHERE author_id = viewer_id
ORDER BY id ASC 
"""
psql.sqldf(query, locals())

   id
0   4
1   7

### Exercice 5 : Invalid Tweets

###### https://leetcode.com/problems/invalid-tweets/?envType=study-plan-v2&envId=top-sql-50

In [11]:
tweets_data = {
    'tweet_id': [1, 2],
    'content': [
        'Let us Code',
        'More than fifteen chars are here!'
    ]
}

Tweets = pd.DataFrame(tweets_data)
Tweets

   tweet_id                            content
0         1                        Let us Code
1         2  More than fifteen chars are here!

In [13]:
query = """
SELECT tweet_id
FROM Tweets
WHERE length(content) > 15
"""
psql.sqldf(query, locals())

   tweet_id
0         2

## BASIC JOINS

### Exercice 6 : Replace Employee ID With The Unique Identifier
###### https://leetcode.com/problems/replace-employee-id-with-the-unique-identifier/description/?envType=study-plan-v2&envId=top-sql-50

In [14]:
employees_data = {
    'id': [1, 7, 11, 90, 3],
    'name': ['Alice', 'Bob', 'Meir', 'Winston', 'Jonathan']
}

Employees = pd.DataFrame(employees_data)
Employees

   id      name
0   1     Alice
1   7       Bob
2  11      Meir
3  90   Winston
4   3  Jonathan

In [15]:
employeeuni_data = {
    'id': [3, 11, 90],
    'unique_id': [1, 2, 3]
}

EmployeeUNI = pd.DataFrame(employeeuni_data)
EmployeeUNI

   id  unique_id
0   3          1
1  11          2
2  90          3

In [17]:
query = """
SELECT unique_id, name
FROM Employees e
LEFT JOIN EmployeeUNI eu ON e.id = eu.id
"""
psql.sqldf(query, locals())

   unique_id      name
0        NaN     Alice
1        NaN       Bob
2        2.0      Meir
3        3.0   Winston
4        1.0  Jonathan

### Exercice 7 : Product Sales Analysis I
###### https://leetcode.com/problems/product-sales-analysis-i/?envType=study-plan-v2&envId=top-sql-50

In [20]:
sales_data = {
    'sale_id': [1, 2, 7],
    'product_id': [100, 100, 200],
    'year': [2008, 2009, 2011],
    'quantity': [10, 12, 15],
    'price': [5000, 5000, 9000]
}

Sales = pd.DataFrame(sales_data)
Sales

   sale_id  product_id  year  quantity  price
0        1         100  2008        10   5000
1        2         100  2009        12   5000
2        7         200  2011        15   9000

In [18]:
product_data = {
    'product_id': [100, 200, 300],
    'product_name': ['Nokia', 'Apple', 'Samsung']
}

# Création du DataFrame pour Product
Product = pd.DataFrame(product_data)
Product

   product_id product_name
0         100        Nokia
1         200        Apple
2         300      Samsung

In [22]:
query = """
SELECT product_name, year, price
FROM Sales
JOIN Product ON Sales.product_id = Product.product_id
"""
psql.sqldf(query, locals())

  product_name  year  price
0        Nokia  2008   5000
1        Nokia  2009   5000
2        Apple  2011   9000

### Exercice 8 : Customer Who Visited But Did Not Make Any Transactions
###### https://leetcode.com/problems/customer-who-visited-but-did-not-make-any-transactions/description/?envType=study-plan-v2&envId=top-sql-50

In [23]:
visits_data = {
    'visit_id': [1, 2, 4, 5, 6, 7, 8],
    'customer_id': [23, 9, 30, 54, 96, 54, 54]
}

Visits = pd.DataFrame(visits_data)
Visits

   visit_id  customer_id
0         1           23
1         2            9
2         4           30
3         5           54
4         6           96
5         7           54
6         8           54

In [24]:
transactions_data = {
    'transaction_id': [2, 3, 9, 12, 13],
    'visit_id': [5, 5, 5, 1, 2],
    'amount': [310, 300, 200, 910, 970]
}

Transactions = pd.DataFrame(transactions_data)
Transactions

   transaction_id  visit_id  amount
0               2         5     310
1               3         5     300
2               9         5     200
3              12         1     910
4              13         2     970

In [25]:
query = """
SELECT customer_id, count(*) AS count_no_trans
FROM Visits
LEFT JOIN Transactions ON Transactions.visit_id = Visits.visit_id
WHERE Transactions.transaction_id IS NULL
GROUP BY customer_id
"""
psql.sqldf(query, locals())

   customer_id  count_no_trans
0           30               1
1           54               2
2           96               1

### Exercice 9 : Rising Temperature
###### https://leetcode.com/problems/rising-temperature/description/?envType=study-plan-v2&envId=top-sql-50

In [26]:
weather_data = {
    'id': [1, 2, 3, 4],
    'recordDate': ['2015-01-01', '2015-01-02', '2015-01-03', '2015-01-04'],
    'temperature': [10, 25, 20, 30]
}

Weather = pd.DataFrame(weather_data)
Weather

   id  recordDate  temperature
0   1  2015-01-01           10
1   2  2015-01-02           25
2   3  2015-01-03           20
3   4  2015-01-04           30

In [28]:
# Fonctionne sous MySQL mais pas sous SQLite
query = """
SELECT w.id
FROM Weather
JOIN Weather w ON DATEDIFF(Weather.recordDate, w.recordDate) = -1
WHERE w.temperature > Weather.temperature
"""
psql.sqldf(query, locals())

PandaSQLException: (sqlite3.OperationalError) no such function: DATEDIFF
[SQL:
SELECT w.id
FROM Weather
JOIN Weather w ON DATEDIFF(Weather.recordDate, w.recordDate) = -1
WHERE w.temperature > Weather.temperature
]
(Background on this error at: https://sqlalche.me/e/20/e3q8)

In [31]:
# SQLite (attention, pas le même output bizaremment)
query = """
SELECT w.id
FROM Weather
JOIN Weather w ON Weather.recordDate = DATE(w.recordDate, '+1 day')
WHERE w.temperature > Weather.temperature;
"""
psql.sqldf(query, locals())

   id
0   2